wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Include/gd32h77x_ospi.h
/* OSPI_DCFG3 */
#define OSPI_DCFG3_REFRATE                BITS(0,31)                           /*!< refresh rate */

/* OSPI_STAT */
#define OSPI_STAT_TERR                    BIT(0)                               /*!< transfer error flag */
#define OSPI_STAT_TC                      BIT(1)                               /*!< transfer complete flag */
#define OSPI_STAT_FT                      BIT(2)                               /*!< fifo threshold flag */
#define OSPI_STAT_SM                      BIT(3)                               /*!< status match flag */
#define OSPI_STAT_TMOUT                   BIT(4)                               /*!< timeout flag */
#define OSPI_STAT_BUSY                    BIT(5)                               /*!< busy flag */
#define OSPI_STAT_FL                      BITS(8,13)                           /*!< fifo level */

/* OSPI_STATC */
#define OSPI_STATC_TERRC                  BIT(0)                               /*!< clear transfer error flag */
#define OSPI_STATC_TCC                    BIT(1)                               /*!< clear transfer complete flag */
#define OSPI_STATC_SMC                    BIT(3)                               /*!< clear status match flag */
#define OSPI_STATC_TMOUTC                 BIT(4)                               /*!< clear timeout flag */

/* OSPI_DTLEN */
#define OSPI_DTLEN_DTLEN                  BITS(0,31)                           /*!< data length */

/* OSPI_ADDR */
#define OSPI_ADDR_ADDR                    BITS(0,31)                           /*!< address to be send to the external flash memory */

/* OSPI_DATA */
#define OSPI_DATA_DATA                    BITS(0,31)                           /*!< data to be transferred through the flash memory */

/* OSPI_STATMK */
#define OSPI_STATMK_MASK                  BITS(0,31)                           /*!< status mask */

/* OSPI_STATMATCH */
#define OSPI_STATMATCH_MATCH              BITS(0,31)                           /*!< status match */

/* OSPI_INTERVAL */
#define OSPI_INTERVAL_INTERVAL            BITS(0,15)                           /*!< interval cycle */

/* OSPI_TCFG */
#define OSPI_TCFG_IMOD                    BITS(0,2)                            /*!< instruction mode */
#define OSPI_TCFG_INSDTR                  BIT(3)                               /*!< instruction double transfer rate */
#define OSPI_TCFG_INSSZ                   BITS(4,5)                            /*!< instruction size */
#define OSPI_TCFG_ADDRMOD                 BITS(8,10)                           /*!< address mode */
#define OSPI_TCFG_ADDRDTR                 BIT(11)                              /*!< address double transfer rate */
#define OSPI_TCFG_ADDRSZ                  BITS(12,13)                          /*!< address size */
#define OSPI_TCFG_ALTEMOD                 BITS(16,18)                          /*!< alternate bytes mode */
#define OSPI_TCFG_ABDTR                   BIT(19)                              /*!< alternate bytes double transfer rate */
#define OSPI_TCFG_ALTESZ                  BITS(20,21)                          /*!< alternate bytes size */
#define OSPI_TCFG_DATAMOD                 BITS(24,26)                          /*!< data mode */
#define OSPI_TCFG_DADTR                   BIT(27)                              /*!< data double transfer rate */
#define OSPI_TCFG_DQSEN                   BIT(29)                              /*!< dqs enable */
#define OSPI_TCFG_SIOO                    BIT(31)                              /*!< send instruction only once mode */

/* OSPI_TIMCFG */
#define OSPI_TIMCFG_DUMYC                 BITS(0,4)                            /*!< number of dummy cycles */
#define OSPI_TIMCFG_DEHQC                 BIT(28)                              /*!< delay hold quarter cycle */
#define OSPI_TIMCFG_SSAMPLE               BIT(30)                              /*!< sample shift */

/* OSPI_INS */
#define OSPI_INS_INSTRUCTION              BITS(0,31)                           /*!< command information to be send to the flash memory */

/* OSPI_ALTE */
#define OSPI_ALTE_ALTE                    BITS(0,31)                           /*!< optional data to be send to the flash memory */

/* OSPI_LPOUT */
#define OSPI_LPOUT_TIMEOUT                BITS(0,15)                           /*!< timeout period */

/* OSPI_WPTCFG */
#define OSPI_WPTCFG_IMOD                  BITS(0,2)                            /*!< instruction mode */
#define OSPI_WPTCFG_INSDTR                BIT(3)                               /*!< instruction double transfer rate */
#define OSPI_WPTCFG_INSSZ                 BITS(4,5)                            /*!< instruction size */
#define OSPI_WPTCFG_ADDRMOD               BITS(8,10)                           /*!< address mode */
#define OSPI_WPTCFG_ADDRDTR               BIT(11)                              /*!< address double transfer rate */
#define OSPI_WPTCFG_ADDRSZ                BITS(12,13)                          /*!< address size */
#define OSPI_WPTCFG_ALTEMOD               BITS(16,18)                          /*!< alternate bytes mode */
#define OSPI_WPTCFG_ABDTR                 BIT(19)                              /*!< alternate bytes double transfer rate */
#define OSPI_WPTCFG_ALTESZ                BITS(20,21)                          /*!< alternate bytes size */
#define OSPI_WPTCFG_DATAMOD               BITS(24,26)                          /*!< data mode */
#define OSPI_WPTCFG_DADTR                 BIT(27)                              /*!< data double transfer rate */
#define OSPI_WPTCFG_DQSEN                 BIT(29)                              /*!< dqs enable */

/* OSPI_WPTIMCFG */
#define OSPI_WPTIMCFG_DUMYC               BITS(0,4)                            /*!< number of dummy cycles */

/* OSPI_WPINS */
#define OSPI_WPINS_INSTRUCTION            BITS(0,31)                           /*!< command information to be send to the flash memory */

/* OSPI_WPALTE */
#define OSPI_WPALTE_ALTE                  BITS(0,31)                           /*!< optional data to be send to the flash memory */

