wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Include/gd32h77x_ospi.h
/* OSPI_WTCFG */
#define OSPI_WTCFG_IMOD                   BITS(0,2)                            /*!< instruction mode */
#define OSPI_WTCFG_INSDTR                 BIT(3)                               /*!< instruction double transfer rate */
#define OSPI_WTCFG_INSSZ                  BITS(4,5)                            /*!< instruction size */
#define OSPI_WTCFG_ADDRMOD                BITS(8,10)                           /*!< address mode */
#define OSPI_WTCFG_ADDRDTR                BIT(11)                              /*!< address double transfer rate */
#define OSPI_WTCFG_ADDRSZ                 BITS(12,13)                          /*!< address size */
#define OSPI_WTCFG_ALTEMOD                BITS(16,18)                          /*!< alternate bytes mode */
#define OSPI_WTCFG_ABDTR                  BIT(19)                              /*!< alternate bytes double transfer rate */
#define OSPI_WTCFG_ALTESZ                 BITS(20,21)                          /*!< alternate bytes size */
#define OSPI_WTCFG_DATAMOD                BITS(24,26)                          /*!< data mode */
#define OSPI_WTCFG_DADTR                  BIT(27)                              /*!< data double transfer rate */
#define OSPI_WTCFG_DQSEN                  BIT(29)                              /*!< dqs enable */

/* OSPI_WTIMCFG */
#define OSPI_WTIMCFG_DUMYC                BITS(0,4)                            /*!< number of dummy cycles */

/* OSPI_WINS */
#define OSPI_WINS_INSTRUCTION             BITS(0,31)                           /*!< command information to be send to the flash memory */

/* OSPI_WALTE */
#define OSPI_WALTE_ALTE                   BITS(0,31)                           /*!< optional data to be send to the flash memory */

/* OSPI_HBLCFG */
#define OSPI_HBLCFG_LMOD                  BIT(0)                               /*!< latency mode */
#define OSPI_HBLCFG_WZLAT                 BIT(1)                               /*!< write zero latency */
#define OSPI_HBLCFG_ACCTM                 BITS(8,15)                           /*!< access time */
#define OSPI_HBLCFG_RWRTM                 BITS(16,23)                          /*!< read write recovery time */

/* constants definitions */
/* ospi init struct definitions */
typedef struct {
    uint32_t prescaler;                                                        /*!< specifies the prescaler factor for generating clock based on the AHB clock.
                                                                                    this parameter can be a number between 0 and 255 */
    uint32_t fifo_threshold;                                                   /*!< specifies the threshold number of bytes in the FIFO (used only in indirect mode)
                                                                                    this parameter can be a value between 1 and 16 */
    uint32_t sample_shift;                                                     /*!< specifies the Sample Shift. The data is sampled 1/2 clock cycle delay later to
                                                                                    take in account external signal delays. (it should be OSPI_SAMPLE_SHIFTING_NONE in DTR mode) */
    uint32_t device_size;                                                      /*!< specifies the Flash Size. FlashSize+1 is effectively the number of address bits
                                                                                    required to address the flash memory. The flash capacity can be up to 4GB
                                                                                    (addressed using 32 bits) in indirect mode, but the addressable space in
                                                                                    memory-mapped mode is limited to 256MB
                                                                                    this parameter can be a number between 0 and 31 */
    uint32_t cs_hightime;                                                      /*!< specifies the chip select high time. chipselecthightime+1 defines the minimum number
                                                                                    of clock cycles which the chip select must remain high between commands. */

    uint32_t dual_quad;                                                        /*!< it enables or not the dual-quad mode which allow to access up to
                                                                                    quad mode on two different devices to increase the throughput. */
    uint32_t memory_type;                                                      /*!< it indicates the external device type connected to the OSPI. */

    uint32_t free_clock_run;                                                   /*!< it enables or not the free running clock. */

    uint32_t delay_hold_cycle;                                                 /*!< it allows to hold to 1/4 cycle the data. */

    uint32_t delay_block_bypass;                                               /*!< it enables the delay block bypass, so the sampling is not affected
                                                                                    by the delay block. */
    uint32_t refrate;                                                          /*!< it enables the refresh rate feature. The chip select is released every
                                                                                    refrate+1 clock cycles.
                                                                                    this parameter can be a value between 0 and 0xFFFFFFFF */
} ospi_parameter_struct;

/* ospi regular command struct definitions */
typedef struct {
    uint32_t operation_type;                                                   /*!< it indicates if the configuration applies to the common registers or
                                                                                    to the registers for the write operation (these registers are only
                                                                                    used for memory-mapped mode). */
    uint32_t device_id;                                                        /*!< it indicates which external device is selected for this command (it
                                                                                    applies only if dualquad is disabled in the initialization structure). */
    uint32_t instruction;                                                      /*!< it contains the instruction to be sent to the device.
                                                                                    this parameter can be a value between 0 and 0xFFFFFFFF */
    uint32_t ins_mode;                                                         /*!< it indicates the mode of the instruction. */

    uint32_t ins_size;                                                         /*!< it indicates the size of the instruction. */

