wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Include/gd32h77x_ospi.h
/* OSPI flash memory size */
#define OSPI_MESZ(regval)                 (BITS(16,20) & ((uint32_t)(regval) << 16U))
#define OSPI_MESZ_2_BYTES                 OSPI_MESZ(0)                         /*!< the size of external memory is 2 bytes */
#define OSPI_MESZ_4_BYTES                 OSPI_MESZ(1)                         /*!< the size of external memory is 4 bytes */
#define OSPI_MESZ_8_BYTES                 OSPI_MESZ(2)                         /*!< the size of external memory is 8 bytes */
#define OSPI_MESZ_16_BYTES                OSPI_MESZ(3)                         /*!< the size of external memory is 16 bytes */
#define OSPI_MESZ_32_BYTES                OSPI_MESZ(4)                         /*!< the size of external memory is 32 bytes */
#define OSPI_MESZ_64_BYTES                OSPI_MESZ(5)                         /*!< the size of external memory is 64 bytes */
#define OSPI_MESZ_128_BYTES               OSPI_MESZ(6)                         /*!< the size of external memory is 128 bytes */
#define OSPI_MESZ_256_BYTES               OSPI_MESZ(7)                         /*!< the size of external memory is 256 bytes */
#define OSPI_MESZ_512_BYTES               OSPI_MESZ(8)                         /*!< the size of external memory is 512 bytes */
#define OSPI_MESZ_1024_BYTES              OSPI_MESZ(9)                         /*!< the size of external memory is 1024 bytes */
#define OSPI_MESZ_2_KBS                   OSPI_MESZ(10)                        /*!< the size of external memory is 2 KB */
#define OSPI_MESZ_4_KBS                   OSPI_MESZ(11)                        /*!< the size of external memory is 4 KB */
#define OSPI_MESZ_8_KBS                   OSPI_MESZ(12)                        /*!< the size of external memory is 8 KB */
#define OSPI_MESZ_16_KBS                  OSPI_MESZ(13)                        /*!< the size of external memory is 16 KB */
#define OSPI_MESZ_32_KBS                  OSPI_MESZ(14)                        /*!< the size of external memory is 32 KB */
#define OSPI_MESZ_64_KBS                  OSPI_MESZ(15)                        /*!< the size of external memory is 64 KB */
#define OSPI_MESZ_128_KBS                 OSPI_MESZ(16)                        /*!< the size of external memory is 128 KB */
#define OSPI_MESZ_256_KBS                 OSPI_MESZ(17)                        /*!< the size of external memory is 256 KB */
#define OSPI_MESZ_512_KBS                 OSPI_MESZ(18)                        /*!< the size of external memory is 512 KB */
#define OSPI_MESZ_1024_KBS                OSPI_MESZ(19)                        /*!< the size of external memory is 1024 KBS */
#define OSPI_MESZ_2_MBS                   OSPI_MESZ(20)                        /*!< the size of external memory is 2 MB */
#define OSPI_MESZ_4_MBS                   OSPI_MESZ(21)                        /*!< the size of external memory is 4 MB */
#define OSPI_MESZ_8_MBS                   OSPI_MESZ(22)                        /*!< the size of external memory is 8 MB */
#define OSPI_MESZ_16_MBS                  OSPI_MESZ(23)                        /*!< the size of external memory is 16 MB */
#define OSPI_MESZ_32_MBS                  OSPI_MESZ(24)                        /*!< the size of external memory is 32 MB */
#define OSPI_MESZ_64_MBS                  OSPI_MESZ(25)                        /*!< the size of external memory is 64 MB */
#define OSPI_MESZ_128_MBS                 OSPI_MESZ(26)                        /*!< the size of external memory is 128 MB */
#define OSPI_MESZ_256_MBS                 OSPI_MESZ(27)                        /*!< the size of external memory is 256 MB */
#define OSPI_MESZ_512_MBS                 OSPI_MESZ(28)                        /*!< the size of external memory is 512 MB */
#define OSPI_MESZ_1024_MBS                OSPI_MESZ(29)                        /*!< the size of external memory is 1024 MB */
#define OSPI_MESZ_2048_MBS                OSPI_MESZ(30)                        /*!< the size of external memory is 2048 MB */
#define OSPI_MESZ_4096_MBS                OSPI_MESZ(31)                        /*!< the size of external memory is 4096 MB */

/* OSPI device type select */
#define OSPI_DTYSEL(regval)               (BITS(24,26) & ((uint32_t)(regval) << 24U))
#define OSPI_MICRON_MODE                  OSPI_DTYSEL(0)                       /*!< device type select micron mode */
#define OSPI_MACRONIX_MODE                OSPI_DTYSEL(1)                       /*!< device type select micronix mode */
#define OSPI_STANDARD_MODE                OSPI_DTYSEL(2)                       /*!< device type select standard mode */
#define OSPI_MACRONIX_RAM_MODE            OSPI_DTYSEL(3)                       /*!< device type select micronix ram mode */
#define OSPI_HYPERBUS_MEMORY_MODE         OSPI_DTYSEL(4)                       /*!< device type select hyperbus memory mode */
#define OSPI_HYPERBUS_REGISTER_MODE       OSPI_DTYSEL(5)                       /*!< device type select hyperbus register mode */
#define OSPI_RESERVE_MODE                 OSPI_DTYSEL(7)                       /*!< reserve mode, not use */

/* OSPI prescaler set */
#define OSPI_PSC(regval)                  (BITS(0,7) & ((uint32_t)(regval) << 0U))

/* OSPI transmit configuration */
/* OSPI operation type */
#define OSPI_OPTYPE_COMMON_CFG           ((uint32_t)0x00000000U)               /*!< common configuration (indirect or auto-polling mode) */
#define OSPI_OPTYPE_READ_CFG             ((uint32_t)0x00000001U)               /*!< read configuration (memory-mapped mode) */
#define OSPI_OPTYPE_WRITE_CFG            ((uint32_t)0x00000002U)               /*!< write configuration (memory-mapped mode) */
#define OSPI_OPTYPE_WRAP_CFG             ((uint32_t)0x00000003U)               /*!< wrap configuration (memory-mapped mode) */

/* OSPI instruction mode */
#define OSPI_IMOD(regval)                 (BITS(0,2) & ((uint32_t)(regval) << 0U))
#define OSPI_INSTRUCTION_NONE             OSPI_IMOD(0)                         /*!< no instruction mode */
#define OSPI_INSTRUCTION_1_LINE           OSPI_IMOD(1)                         /*!< instruction mode on a single line */
#define OSPI_INSTRUCTION_2_LINES          OSPI_IMOD(2)                         /*!< instruction mode on two lines */
#define OSPI_INSTRUCTION_4_LINES          OSPI_IMOD(3)                         /*!< instruction mode on four lines */
#define OSPI_INSTRUCTION_8_LINES          OSPI_IMOD(4)                         /*!< instruction mode on eight lines */

/* OSPI instruction size */
#define OSPI_INSSZ(regval)                (BITS(4,5) & ((uint32_t)(regval) << 4U))
#define OSPI_INSTRUCTION_8_BITS           OSPI_INSSZ(0)                        /*!< instruction size on 8-bit address */
#define OSPI_INSTRUCTION_16_BITS          OSPI_INSSZ(1)                        /*!< instruction size on 16-bit address */
#define OSPI_INSTRUCTION_24_BITS          OSPI_INSSZ(2)                        /*!< instruction size on 24-bit address */
#define OSPI_INSTRUCTION_32_BITS          OSPI_INSSZ(3)                        /*!< instruction size on 32-bit address */

/* OSPI instruction double transfer rate */
#define OSPI_INSDTR_MODE_DISABLE          ((uint32_t)0x00000000U)              /*!< instruction double transfer rate mode disable */
#define OSPI_INSDTR_MODE_ENABLE           OSPI_TCFG_INSDTR                     /*!< instruction double transfer rate mode enable */

/* OSPI address mode */
#define OSPI_ADDRMOD(regval)              (BITS(8,10) & ((uint32_t)(regval) << 8U))
#define OSPI_ADDRESS_NONE                 OSPI_ADDRMOD(0)                      /*!< no address mode */
#define OSPI_ADDRESS_1_LINE               OSPI_ADDRMOD(1)                      /*!< address mode on a single line */
#define OSPI_ADDRESS_2_LINES              OSPI_ADDRMOD(2)                      /*!< address mode on two lines */
#define OSPI_ADDRESS_4_LINES              OSPI_ADDRMOD(3)                      /*!< address mode on four lines */
#define OSPI_ADDRESS_8_LINES              OSPI_ADDRMOD(4)                      /*!< address mode on eight lines */

