wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Include/gd32h77x_ospi.h
/* OSPI abort functions */
/* abort the current transmission */
void ospi_transmission_abort(uint32_t ospi_periph);
/* abort the current transmission(non-blocking function) */
void ospi_interrupt_transmission_abort(uint32_t ospi_periph);

/* OSPI wrap configure functions */
/* configure wrap instruction mode */
void ospi_wrap_instruction_config(uint32_t ospi_periph, uint32_t imod, uint32_t insdtr, uint32_t inssz, uint32_t instruction);
/* configure wrap address mode */
void ospi_wrap_address_config(uint32_t ospi_periph, uint32_t addrmod, uint32_t addrdtr, uint32_t addrsz, uint32_t addr);
/* configure wrap alternate bytes mode */
void ospi_wrap_alternate_bytes_config(uint32_t ospi_periph, uint32_t atlemod, uint32_t abdtr, uint32_t altesz, uint32_t alte);
/* configure wrap data mode */
void ospi_wrap_data_config(uint32_t ospi_periph, uint32_t datamod, uint32_t dadtr);
/* enable OSPI wrap dqs mode */
void ospi_wrap_dqs_enable(uint32_t ospi_periph);
/* disable OSPI wrap dqs mode */
void ospi_wrap_dqs_disable(uint32_t ospi_periph);
/* configure wrap dummy cycles number */
void ospi_wrap_dummy_cycles_config(uint32_t ospi_periph, uint32_t dumyc);

/* OSPI write configure functions */
/* configure write instruction mode */
void ospi_write_instruction_config(uint32_t ospi_periph, uint32_t imod, uint32_t insdtr, uint32_t inssz, uint32_t instruction);
/* configure write address mode */
void ospi_write_address_config(uint32_t ospi_periph, uint32_t addrmod, uint32_t addrdtr, uint32_t addrsz, uint32_t addr);
/* configure write alternate bytes mode */
void ospi_write_alternate_bytes_config(uint32_t ospi_periph, uint32_t atlemod, uint32_t abdtr, uint32_t altesz, uint32_t alte);
/* configure write data mode */
void ospi_write_data_config(uint32_t ospi_periph, uint32_t datamod, uint32_t dadtr);
/* enable OSPI write dqs mode */
void ospi_write_dqs_enable(uint32_t ospi_periph);
/* disable OSPI write dqs mode */
void ospi_write_dqs_disable(uint32_t ospi_periph);
/* configure write dummy cycles number */
void ospi_write_dummy_cycles_config(uint32_t ospi_periph, uint32_t dumyc);

/* OSPI hyperbus functions */
/* latency mode */
void ospi_latency_mode_config(uint32_t ospi_periph, uint32_t lmod);
/* enable write zero latency */
void ospi_write_zero_latency_enable(uint32_t ospi_periph);
/* disable write zero latency */
void ospi_write_zero_latency_disable(uint32_t ospi_periph);

/* OSPI senior functions */
/* configure OSPI regular command parameter */
void ospi_command_config(uint32_t ospi_periph, ospi_parameter_struct *ospi_struct, ospi_regular_cmd_struct *cmd_struct);
/* configure OSPI hyperbus parameter */
void ospi_hyperbus_config(uint32_t ospi_periph, ospi_hyperbus_cfg_struct *hyperbus_cfg_struct);
/* configure OSPI hyperbus command parameter */
void ospi_hyperbus_cmd_config(uint32_t ospi_periph, ospi_parameter_struct *ospi_struct, ospi_hyperbus_cmd_struct *hyperbus_cmd_struct);
/* OSPI transmit */
void ospi_transmit(uint32_t ospi_periph, uint8_t *pdata);
/* OSPI receive */
void ospi_receive(uint32_t ospi_periph, ospi_parameter_struct *ospi_struct, uint8_t *pdata);
/* configure OSPI autopolling mode */
void ospi_autopolling_mode(uint32_t ospi_periph, ospi_parameter_struct *ospi_struct, ospi_autopolling_struct *autopl_cfg_struct);
/* configure the OSPI memory mapped mode */
void ospi_memorymapped_mode(uint32_t ospi_periph, ospi_memorymapped_struct *memapped_cfg_struct);

/* flag & interrupt functions */
/* enable OSPI interrupt */
void ospi_interrupt_enable(uint32_t ospi_periph, uint32_t interrupt);
/* disable OSPI interrupt */
void ospi_interrupt_disable(uint32_t ospi_periph, uint32_t interrupt);
/* get OSPI fifo level */
uint32_t ospi_fifo_level_get(uint32_t ospi_periph);
/* get OSPI flag status */
FlagStatus ospi_flag_get(uint32_t ospi_periph, uint32_t flag);
/* clear OSPI flag status */
void ospi_flag_clear(uint32_t ospi_periph, uint32_t flag);
/* get OSPI interrupt status */
FlagStatus ospi_interrupt_flag_get(uint32_t ospi_periph, uint8_t interrupt);
/* clear OSPI interrupt flag status */
void ospi_interrupt_flag_clear(uint32_t ospi_periph, uint32_t flag);

#endif /* GD32H77X_OSPI_H */
